src/main/resources/examples/describeMetadata-request.xml

<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<env:Header>
<SessionHeader xmlns="http://soap.sforce.com/2006/04/metadata">
<sessionId>00Df4000001dNas!ARQAQKlnU6So9sA7SAL.099zrkwsMFVRxvzfEcHsSHaLWHuJxCSNk4c2BkGJrJPRodMtuDKY7WaEiORQya9QmNx94yQAbTp8</sessionId>
</SessionHeader>
</env:Header>
<env:Body>
<m:describeMetadata xmlns:m="http://soap.sforce.com/2006/04/metadata" xmlns:sobj="null">
<m:asOfVersion>41.0</m:asOfVersion>
</m:describeMetadata>
</env:Body>
</env:Envelope>
